First/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ТипКлиента</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

First/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

First/src/Catalogs/Контрагенты/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТипКлиента = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)        
	
	ТипКлиентаЮрЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ТипКлиентаФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;        

	ДлинаИНН = СтрДлина(ИНН);
	ДлинаКПП = СтрДлина(КПП);   
	
	ЧисловойРяд = "0123456789";
                            
	Если ТипКлиента = ТипКлиентаЮрЛицо И ДлинаИНН <> 10 И ДлинаИНН <> 0 Тогда
		Сообщить("Длина ИНН должна быть 10 символов!");
		Отказ = Истина;
  	ИначеЕсли ТипКлиента = ТипКлиентаЮрЛицо И ДлинаКПП < 9 Тогда
		Сообщить("Длина КПП должна быть 9 символов!");
		Отказ = Истина;
	ИначеЕсли ТипКлиента = ТипКлиентаФизЛицо И ДлинаИНН <> 12 И ДлинаИНН <> 0 Тогда
		Сообщить("Длина ИНН должна быть 12 символов!");
		Отказ = Истина;
	ИначеЕсли ТипКлиента = ТипКлиентаФизЛицо И ДлинаКПП > 0 Тогда
		Сообщить("КПП заполнять не нужно!");
		Отказ = Истина;
	КонецЕсли;
	
	// Проверка на наличие НЕ цифр в ИНН
	Для Счетчик = 1 По ДлинаИНН Цикл
		
		  СимволСтроки = Сред(ИНН, Счетчик, 1);
		  Если СтрНайти(ЧисловойРяд, СимволСтроки) = 0 Тогда
			  Сообщить("В ИНН должны быть только цифры! Найден лишний символ: " + СимволСтроки);
			  Отказ = Истина;
			  Прервать;
		  КонецЕсли;
		
	КонецЦикла;
	  
	// Проверка на наличие НЕ цифр в КПП
	Для Счетчик = 1 По ДлинаКПП Цикл
		
		  СимволСтроки = Сред(КПП, Счетчик, 1);
		  Если СтрНайти(ЧисловойРяд, СимволСтроки) = 0 Тогда
			  Сообщить("В КПП должны быть только цифры! Найден лишний символ: " + СимволСтроки);
			  Отказ = Истина;
			  Прервать;
		  КонецЕсли;
		
	  КонецЦикла;  
	  
	    // Проверка на корректность ИНН
		Если РаботаСИНН.ИННВерен(ИНН) = Ложь Тогда
		     Сообщить("Контрольная сумма ИНН не совпадает, проверьте правильность ввода");
		КонецЕсли;  
		Если ЗначениеЗаполнено(РаботаСИНН.ПроверкаИННСВыводом(ИНН)) Тогда
		     Сообщить(РаботаСИНН.ПроверкаИННСВыводом(ИНН));
		КонецЕсли; 
		

КонецПроцедуры
